In [5]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

In [ ]:
#1

In [36]:
df = pd.read_sql('SELECT DISTINCT COUNT(*) FROM category',con=connection_sqlalchemy)
df

   count
0     16

In [ ]:
#2

In [43]:
df = pd.read_sql('SELECT DISTINCT name FROM category ORDER BY name ASC',con=connection_sqlalchemy)
df

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

In [ ]:
#3

In [55]:
df = pd.read_sql('SELECT title FROM film ORDER BY release_year ASC LIMIT 1',con=connection_sqlalchemy)
df

             title
0  Chamber Italian

In [57]:
df = pd.read_sql('SELECT title FROM film ORDER BY release_year DESC LIMIT 1',con=connection_sqlalchemy)
df

             title
0  Chamber Italian

In [ ]:
#4

In [68]:
df = pd.read_sql("SELECT COUNT(*) FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01'",con=connection_sqlalchemy)
df

   count
0   6709

In [69]:
df = pd.read_sql("SELECT COUNT(*) FROM rental WHERE rental_date BETWEEN '2010-01-01' AND '2011-02-01'",con=connection_sqlalchemy)
df

   count
0      0

In [ ]:
#5

In [73]:
df = pd.read_sql("SELECT MAX(amount) FROM payment",con=connection_sqlalchemy)
df

     max
0  11.99

In [ ]:
#6

In [81]:
df = pd.read_sql("SELECT * FROM customer LEFT JOIN address ON address.address_id = customer.address_id LEFT JOIN city ON city.city_id = address.city_id LEFT JOIN country ON country.country_id = city.country_id WHERE country IN('Poland')",con=connection_sqlalchemy)
df

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active,...,postal_code,phone,last_update,city_id,city,country_id,last_update,country_id,country,last_update
0,318,1,Brian,Wyman,brian.wyman@sakilacustomer.org,323,True,2006-02-14,2013-05-26 14:49:45.738,1,...,25787,556100547674,2006-02-15 09:45:30,97,Bydgoszcz,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
1,572,1,Sidney,Burleson,sidney.burleson@sakilacustomer.org,578,True,2006-02-14,2013-05-26 14:49:45.738,1,...,86587,867287719310,2006-02-15 09:45:30,133,Czestochowa,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
2,128,1,Marjorie,Tucker,marjorie.tucker@sakilacustomer.org,132,True,2006-02-14,2013-05-26 14:49:45.738,1,...,4999,973047364353,2006-02-15 09:45:30,236,Jastrzebie-Zdrj,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
3,270,1,Leah,Curtis,leah.curtis@sakilacustomer.org,275,True,2006-02-14,2013-05-26 14:49:45.738,1,...,83565,701767622697,2006-02-15 09:45:30,255,Kalisz,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
4,501,1,Ruben,Geary,ruben.geary@sakilacustomer.org,506,True,2006-02-14,2013-05-26 14:49:45.738,1,...,16370,52709222667,2006-02-15 09:45:30,314,Lublin,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
5,571,2,Johnnie,Chisholm,johnnie.chisholm@sakilacustomer.org,577,True,2006-02-14,2013-05-26 14:49:45.738,1,...,943,770864062795,2006-02-15 09:45:30,409,Plock,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
6,380,1,Russell,Brinson,russell.brinson@sakilacustomer.org,385,True,2006-02-14,2013-05-26 14:49:45.738,1,...,75442,821476736117,2006-02-15 09:45:30,549,Tychy,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
7,558,1,Jimmie,Eggleston,jimmie.eggleston@sakilacustomer.org,564,True,2006-02-14,2013-05-26 14:49:45.738,0,...,97271,970638808606,2006-02-15 09:45:30,577,Wroclaw,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00